common/models/Product.php

    public function save($runValidation = true, $attributeNames = null)
    {
        $isInsert = $this->isNewRecord;
        if ($isInsert) {
            $this->product_id = Yii::$app->security->generateRandomString(8);
            $this->title = $this->image->name;
            $this->image_name = $this->image->name;
        }
        $saved = parent::save($runValidation, $attributeNames);
        if (!$saved) {
            return false;
        }
        if ($isInsert) {
            $imagePath = Yii::getAlias('@frontend/web/storage/images/' . $this->product_id . '.jpg');
            if (!is_dir(dirname($imagePath))) {
                FileHelper::createDirectory(dirname($imagePath));
---
INSERT INTO `product` (`product_id`, `title`, `image_name`, `status`, `created_at`, `updated_at`, `created_by`) VALUES ('5sbz0D8J', 'item1.png', 'item1.png', 1, 1703545410, 1703545410, 2)