common/models/query/ProductQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `product` WHERE `product_id`='5sbz0D8J'