frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();

        echo "sending";
        return $user->save() && $this->sendEmail($user);
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('test2qewqe', 'test@test.com1qweqwe', '$2y$13$kOR38NkRR5xSRF.RI6JC7.7rdDyTarZ6t3EoCIDGFs4lO.qAHBbcy', 'zO_xhUK4hcmAh8co_nL9zL7KH-1LhvQ-', 'RR5hVBHfvTNKX7axnbwpl_nHAM6Dly1H_1703548835', 9, 1703548835, 1703548835)